<?php
//課題の1----------------------------------------------
$name = "小林";

if ($name === "小林") {
   echo "私は" . $name . "です";
} else {
   echo $name . "ではありません。";
}

//elseを使わないバージョン-----
// if ($name === "小林") {
//    echo "私は" . $name . "です";
// }
// if ($name !== "小林") {
//    echo $name . "ではありません。";
// };
echo '<br>';
echo '<br>';


//課題の2-------------------------------------------------------
$total = 0;

for ($i = 0; $i <= 10000; $i++) {
   $total += $i;
}

echo $total;
echo '<br>';
echo '<br>';


//課題の3-------------------------------------------------------
$fruits = [
   "peach",
   "Apple",
   "orange",
   "Cherry",
   "pear",
];

foreach ($fruits as $fruit) {
   echo $fruit;
   echo '<br>';
}

echo '<br>';


//課題の4-------------------------------------------------------
$start = 1;
$end = 100;

for ($i = $start; $i <= $end; $i++) {
   if ($i % 5 == 0) {
      echo $i;
      echo '<br>';
   }
}


//大幅に変更---------------------
// for ($i = 1; $i <= 100; $i++) {
//    if ($i % 5 == 0) {
//       echo $i;
//       echo '<br>';
//    }
// }

//--------------------------------------------------------